# Core system
base-devel
git
stow

# Desktop (Hyprland)
hyprland
waybar
mako
fuzzel
foot
xdg-desktop-portal-hyprland
polkit-gnome
pipewire
pipewire-pulse
wireplumber

# Development
neovim
tmux
gcc
clang
gdb
valgrind
cmake
make
binutils
strace
ltrace
qemu-full
llvm
lld
nasm
rustup
go
python
python-pip
nodejs
npm
docker
docker-compose
lazygit

# CLI tools
ripgrep
fd
bat
eza
fzf
zoxide
yazi
ffmpegthumbnailer
unar
jq
poppler
imagemagick
htop
btop
curl
wget
httpie
unzip
zip
p7zip
man-db
man-pages
openssh
direnv
starship
delta

# System
networkmanager
nm-connection-editor
bluez
bluez-utils
blueman
brightnessctl
power-profiles-daemon

# Graphics (NVIDIA)
nvidia
nvidia-utils
nvidia-settings

# Wayland tools
wl-clipboard
grim
slurp
kanshi
wlr-randr
swaylock
swayidle

# Fonts
ttf-jetbrains-mono-nerd
noto-fonts
noto-fonts-emoji

# Browsers
firefox
